<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"0223de6ce43576cc469057b9d8436fb63ccb5713c7f7239bd87bb3870d29b480","plan_job_ref":"Job Terraform checks on pull request #45 at https://github.com/sudoblark/sudoblark.terraform.github/actions/runs/13860000294","plan_out_hash":"db157e9073e71177e00f9acffe788a4dccac90c2cb8a9b556c57e236aa48f661","plan_hash":"ba94a890aa016a014441a5b406e218c9a19450e1ea8f7878fbed556a698a8cea","plan_text_format":"diff","version":"1.47.0"} -->
Terraform plan in __./__
<details>
<summary>Plan: 1 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.repositories["sudoblark.python.github-cli"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.python.github-cli"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.python.github-cli"].github_repository.repository will be updated in-place
!~  resource "github_repository" "repository" {
        id                          = "sudoblark.python.github-cli"
        name                        = "sudoblark.python.github-cli"
!~      visibility                  = "private" -> "public"
#        (31 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.repositories["sudoblark.terraform.ci-cd-observability-monitoring"].github_branch_protection.main will be created
+   resource "github_branch_protection" "main" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       blocks_creations                = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "main"
+       repository_id                   = "************"
+       require_conversation_resolution = true
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = true
+           require_code_owner_reviews      = true
+           required_approving_review_count = 1
        }

+       required_status_checks {
+           strict = true
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform checks on pull request #45](https://github.com/sudoblark/sudoblark.terraform.github/actions/runs/13860000294)